<!-- dflook/terraform-github-actions {"workspace":"auto-vars-2","backend_type":"remote","backend":"434fef3afa9f21769596ee185cc6f8053060f21c84feb01cc0dc9dee51e01052","plan_job_ref":"Job Test Terraform cloud #328 at https://github.com/dflook/terraform-github-actions/actions/runs/15341934525","plan_hash":"6e73c0e055971cafd06ae7b0236a9c6740eb155d33a5ceee1cc9828c30e3be7e","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __auto-vars-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   default        = "default"
+   from_tfvars    = "from_tfvars"
+   from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #328](https://github.com/dflook/terraform-github-actions/actions/runs/15341934525)